Revit 2027 API
PlasticVinyl.PlasticvinylPatternAmount Property
 The property labeled "Amount" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string PlasticvinylPatternAmount { get; }
Public Shared ReadOnly Property PlasticvinylPatternAmount As String
	Get
public:
static property String^ PlasticvinylPatternAmount {
	String^ get ();
}
static member PlasticvinylPatternAmount : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 2".
See Also
Reference
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace